---
kind: type
id: T:Autodesk.Revit.DB.ExternalFileUtils
source: html/d6c4104f-ded9-29a4-2296-e1795b0da42a.htm
---
# Autodesk.Revit.DB.ExternalFileUtils

A utility class containing functions related to external file references.

## Syntax (C#)
```csharp
public static class ExternalFileUtils
```

## Remarks
Elements which are external file references refer to files outside of the base .rvt file.
 Examples include Revit links, CAD links, the element which stores the location
 of the keynote file, and rendering decals.